INSERT INTO tax VALUES
(0, 1.1),
(1, 1.08);

INSERT INTO shop VALUES
(1, '日本橋店', '東京都中央区日本橋1-1-1', '03-111-2222'),
(2, '仙台店', '宮城県仙台市青葉区国分町3-7-1', '000-1111-111'),
(3, '那覇店', '沖縄県那覇市泉崎2-4-12', '098-855-0000');

INSERT INTO payment VALUES
(1, '現金'),
(2, '商品券'),
(3, 'クレジットカード'),
(4, 'PayPay'),
(5, 'メルペイ'),
(99, 'その他');

INSERT INTO eat_in VALUES
(0, 1),
(1, 1.1/1.08);  --軽減税率対象外を店内飲食した場合どうしよう

INSERT INTO product VALUES
(1, 'いろはす天然水', 100, 1),
(2, 'ツナマヨおにぎり', 120, 1),
(3, 'ファブリーズ', 400, 0),
(4, 'レジ袋', 3, 0);

INSERT INTO employee VALUES
(1001, 1, '001'),
(1002, 1, '002'),
(1003, 2, '001'),
(1004, 3, '001'),
(1005, 3, '002'),
(1006, 3, '003');

INSERT INTO receipt VALUES
(1, '00000001', '2022/4/1', '19:00', 1001, 1),
(2, '00000001', '2022/4/1', '20:03', 1004, 2);

INSERT INTO rec_pay VALUES
(1, 5, 669);

INSERT INTO rec_detail VALUES
(1, 1, 1, 1, 10, 0),
(2, 1, 2, 1, 0, 0),
(3, 1, 3, 1, 0, 0),
(4, 1, 4, 1, 0, 0);